// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
Console.Clear();
Console.WriteLine("Введите число и я покажу третье число");
string num = Console.ReadLine();
Console.WriteLine($"{num[2]}");